Repository: devgeniem/tms-theme-amuri
Catalog: lang/*.po
Languages: fi

# theme CPT
source: Artists
fi: Taiteilijat

# Breadcrumbs
source: Home
fi: Etusivu

# theme CPT
source: Artwork
fi: Teokset

# theme CPT
source: Exhibition
fi: Näyttelyt

# Breadcrumb text
source: Exhibition
fi: Näyttelyt

source: Search from archive
fi: Hae arkistosta

source: Search
fi: Hae

source: Type a search word
fi: Kirjoita hakusana

source: No results
fi: Ei hakutuloksia

source: Year
fi: Vuosi

source: Selecting the year filter limits the exhibition view.
fi: Vuosisuodattimen valinta rajaa näyttelynäkymän.

source: Upcoming
fi: Tulossa

source: Upcoming exhibitions
fi: Tulevat näyttelyt

source: Current exhibitions
fi: Näyttelyt nyt

source: Past exhibitions
fi: Menneet näyttelyt

source: Filter by year
fi: Rajaa

# filter with search clause results summary
source: %1$1s result found for "%2$2s"
fi: %1$1s tulos haulle “%2$2s”

# filter results summary
source: %1$1s result found
fi: %1$1s tulos haulle

source: Search for artist
fi: Hae taiteilijaa

source: Search query
fi: Kirjoita hakusanat

source: Show All
fi: Kaikki

source: Filter
fi: Rajaa

source: Sort
fi: Järjestä

source: Categories
fi: Avainsanat

source: All
fi: Kaikki

source: Name
fi: Nimen mukaan

source: Name, descending
fi: Nimen mukaan, laskeva

source: Young artist of the year ascending
fi: Valintavuoden mukaan

source: Young artist of the year descending
fi: Valintavuoden mukaan, laskeva

source: View artist
fi: Näytä taiteilija

source: Search for artwork
fi: Hae teosta

source: The Young Artist of the Year %s
fi: Vuoden nuori taiteilija %s

source: Death year
fi: Kuollut

source: Birth year
fi: Syntynyt

source: Related art
fi: Taiteilijan teokset kokoelmissa

# theme-frontend
source: Location
fi: Sijainti

# theme-frontend
source: Artists
fi: Taiteilijat

# theme-frontend
source: Artist
fi: Taiteilija

source: Year of manufacture
fi: Valmistumisvuosi
